In [4]:
import pandas as pd
import numpy as np


s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [8]:
s.

AttributeError: 'Series' object has no attribute 'stack'

In [10]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
# 创建行,索引引用我们的日期,列用一个list
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.264224  0.719898  0.031014  1.128586
2013-01-02 -1.577424 -0.471174  0.387765  0.989143
2013-01-03 -0.234210  1.942903  2.414509  0.819684
2013-01-04 -0.817975 -1.267162 -1.543604 -0.707255
2013-01-05  0.992477  1.233474 -1.468625 -0.568406
2013-01-06  1.825138  0.157946 -0.370861  1.421779

In [13]:
# 头部操作 
df.head(3)

                   A         B         C         D
2013-01-01  0.264224  0.719898  0.031014  1.128586
2013-01-02 -1.577424 -0.471174  0.387765  0.989143
2013-01-03 -0.234210  1.942903  2.414509  0.819684

In [14]:
# 尾部操作
df.tail(3)

                   A         B         C         D
2013-01-04 -0.817975 -1.267162 -1.543604 -0.707255
2013-01-05  0.992477  1.233474 -1.468625 -0.568406
2013-01-06  1.825138  0.157946 -0.370861  1.421779

In [19]:
# 显示索引
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
# 显示行
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [21]:
# 快速汇总
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.075372  0.385981 -0.091634  0.513922
std    1.229965  1.163903  1.456565  0.914773
min   -1.577424 -1.267162 -1.543604 -0.707255
25%   -0.672034 -0.313894 -1.194184 -0.221384
50%    0.015007  0.438922 -0.169924  0.904413
75%    0.810414  1.105080  0.298577  1.093725
max    1.825138  1.942903  2.414509  1.421779

In [22]:
# 数据转置
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.264224   -1.577424   -0.234210   -0.817975    0.992477    1.825138
B    0.719898   -0.471174    1.942903   -1.267162    1.233474    0.157946
C    0.031014    0.387765    2.414509   -1.543604   -1.468625   -0.370861
D    1.128586    0.989143    0.819684   -0.707255   -0.568406    1.421779

In [23]:
# 数值排序
df.sort_values(by='B')

                   A         B         C         D
2013-01-04 -0.817975 -1.267162 -1.543604 -0.707255
2013-01-02 -1.577424 -0.471174  0.387765  0.989143
2013-01-06  1.825138  0.157946 -0.370861  1.421779
2013-01-01  0.264224  0.719898  0.031014  1.128586
2013-01-05  0.992477  1.233474 -1.468625 -0.568406
2013-01-03 -0.234210  1.942903  2.414509  0.819684

In [30]:
df['B']

2013-01-01    0.719898
2013-01-02   -0.471174
2013-01-03    1.942903
2013-01-04   -1.267162
2013-01-05    1.233474
2013-01-06    0.157946
Freq: D, Name: B, dtype: float64

In [32]:
# 切片操作
df[0:3]

                   A         B         C         D
2013-01-01  0.264224  0.719898  0.031014  1.128586
2013-01-02 -1.577424 -0.471174  0.387765  0.989143
2013-01-03 -0.234210  1.942903  2.414509  0.819684

In [34]:
# 标签切片 ,有意思
df.loc[:,['A','C']]

                   A         C
2013-01-01  0.264224  0.031014
2013-01-02 -1.577424  0.387765
2013-01-03 -0.234210  2.414509
2013-01-04 -0.817975 -1.543604
2013-01-05  0.992477 -1.468625
2013-01-06  1.825138 -0.370861

In [37]:
dates[0]

Timestamp('2013-01-01 00:00:00', freq='D')

In [41]:
# 行列交叉获取里面的值 ,选择的是列
df.loc[:,'A']

2013-01-01    0.264224
2013-01-02   -1.577424
2013-01-03   -0.234210
2013-01-04   -0.817975
2013-01-05    0.992477
2013-01-06    1.825138
Freq: D, Name: A, dtype: float64

In [39]:
# 选择的是行
df.iloc[3]

A   -0.817975
B   -1.267162
C   -1.543604
D   -0.707255
Name: 2013-01-04 00:00:00, dtype: float64

In [42]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.577424  0.387765
2013-01-03 -0.234210  2.414509
2013-01-05  0.992477 -1.468625

In [43]:
# 对行切片
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -1.577424 -0.471174  0.387765  0.989143
2013-01-03 -0.234210  1.942903  2.414509  0.819684

In [44]:
# 对列切片
df.iloc[:,1:3]

                   B         C
2013-01-01  0.719898  0.031014
2013-01-02 -0.471174  0.387765
2013-01-03  1.942903  2.414509
2013-01-04 -1.267162 -1.543604
2013-01-05  1.233474 -1.468625
2013-01-06  0.157946 -0.370861

In [45]:
# 布尔索引
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.264224  0.719898  0.031014  1.128586
2013-01-05  0.992477  1.233474 -1.468625 -0.568406
2013-01-06  1.825138  0.157946 -0.370861  1.421779